app/controllers/trips_controller.rb

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "trips" ("trip_number", "distance", "fuel_consumption", "vehicle_id", "created_at", "updated_at", "trip_name") VALUES (?, ?, ?, ?, ?, ?, ?)  [["trip_number", 7], ["distance", 56], ["fuel_consumption", "34"], ["vehicle_id", 3], ["created_at", "2022-09-05 11:07:39.647300"], ["updated_at", "2022-09-05 11:07:39.647300"], ["trip_name", nil]]
---
    def create
        @vehicle = Vehicle.find(params[:vehicle_id])
        @trip = @vehicle.trips.create(trip_params)

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def new
        @vehicle = Vehicle.find(params[:vehicle_id])

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "trips".* FROM "trips" WHERE "trips"."vehicle_id" = ? AND "trips"."id" = ? LIMIT ?  [["vehicle_id", 1], ["id", 1], ["LIMIT", 1]]
---
      def show
        @vehicle = Vehicle.find(params[:vehicle_id])
        @trip=@vehicle.trips.find(params[:id])

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "trips".* FROM "trips" WHERE "trips"."vehicle_id" = ? AND "trips"."id" = ? LIMIT ?  [["vehicle_id", 1], ["id", 1], ["LIMIT", 1]]
---
      def edit
        binding.pry
        @vehicle = Vehicle.find(params[:vehicle_id])
        @trip=@vehicle.trips.find(params[:id])