app/controllers/vehicles_controller.rb

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @vehicle=Vehicle.find(params[:id])

INSERT INTO "vehicles" ("vehicle_number", "vehicle_type", "vehicle_model", "vehicle_color", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @vehicle = Vehicle.new(vehicle_params)

    if @vehicle.save

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @vehicle = Vehicle.find(params[:id])